app/views/albums/show.html.erb


<% @album.photos.each do |photo| %>
---
SELECT "photos".* FROM "photos" WHERE "photos"."album_id" = $1 ORDER BY "photos"."created_at" DESC  [["album_id", 9]]