app/controllers/albums_controller.rb

  def index
    @albums = Album.order(created_at: :desc).all
    @albums.each do |album|
---
SELECT "albums".* FROM "albums" ORDER BY "albums"."created_at" DESC
SELECT "albums".* FROM "albums"

  def show
    @album = Album.find(params[:id])
    @photos = @album.photos.order(created_at: :desc).all
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT "photos".* FROM "photos" WHERE "photos"."album_id" = $1 ORDER BY "photos"."created_at" DESC  [["album_id", 9]]

  def create
    if logged_in?
            @album = Album.new(title: params[:album][:title], description: params[:album][:description], urlimg: params[:album][:urlimg], creator: current_account.fullname, viewcount: 0)
            @album.save
---
INSERT INTO "albums" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2017-10-03 16:44:59.611085"], ["updated_at", "2017-10-03 16:44:59.611085"]]