app/controllers/home_controller.rb

  def index
  	@photos = Photo.order(created_at: :desc).limit(4)
  	@posts = Post.order(created_at: :desc).all.limit(5)
---
SELECT  "photos".* FROM "photos" ORDER BY "photos"."created_at" DESC LIMIT $1  [["LIMIT", 4]]
SELECT  "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC LIMIT $1  [["LIMIT", 5]]