app/controllers/photos_controller.rb

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
	def show
		@album = Album.find(params[:album_id])
		@photo = Photo.find params[:id]

INSERT INTO "photos" ("urlimg", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["urlimg", "http://www.imgworlds.com/wp-content/uploads/2015/12/18-CONTACTUS-HEADER.jpg"], ["created_at", "2017-10-04 14:50:12.384903"], ["updated_at", "2017-10-04 14:50:12.384903"]]
---
	def create

		if logged_in?
    		if current_account.fullname == @album.creator
	    		@photo = Photo.new(urlimg: params[:photo][:urlimg],creator: current_account.fullname, viewcount: 0, album_id: @album.id)
	        	@photo.save