app/controllers/photos_controller.rb

	def create
		@album = Album.find(params[:album_id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]