app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "username", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "adfasdfasdfasd"], ["content", "asfdadfasdfasdf"], ["username", "asfasdfasdfa"], ["created_at", "2017-10-07 01:57:52.083242"], ["updated_at", "2017-10-07 01:57:52.083242"]]
---
    def create
        # @post = Post.new(post_params)
        @post = Post.new(username: "Demo1", title: params[:post][:title], content: params[:post][:content], viewcount: 0)

        @post.save